var button = document.getElementById("myButton");
var quoteElement = document.getElementById("quote");


button.addEventListener("click", function() {
  var quotes = [
    "  ،، إذا لم تكن أنت تغير العالم، فسوف يغير العالم أنت. \n- ( محمد علي كلاي )",
    "الصبر مفتاح الفرج وجنة النجاح.\n- ( علي بن أبي طالب)" ,
    "المستقبل ليس له بديل إلا أن نكون جزءًا منه. ,\n( طه حسين) ",
    "العقل الواعي هو خير مرشد للإنسان.\n- (الشيخ زايد بن سلطان آل نهيان )",
    "الحياة قصيرة، فلا تضيع وقتك في كراهية أو انتقاد الآخرين.  - (\nعمر بن الخطاب )",
    "'الحياة قصيرة، فلا تضيع وقتك في كراهية أو انتقاد الآخرين.'\n-( عمر بن الخطاب )",
    "إذا أردت أن تعيش حياة سعيدة، اربطها بغرض، وليس بشخص أو شيء.(\nألبرت أينشتاين )",
    "العمل الجاد هو مفتاح النجاح. \n- (عبد الحليم حافظ )",
    "التعليم هو سلاح الشعوب في مواجهة التحديات وتحقيق التقدم. \n- (جمال عبد الناصر)",
    "إذا أردت أن تفهم الإنسان، انظر إلى قلبه وليس إلى مظهره.  \n- (إمام علي)"
  ];

  var randomIndex = Math.floor(Math.random() * quotes.length);
  var randomQuote = quotes[randomIndex];

  quoteElement.textContent = randomQuote;
});






